TExley/STM32-ICM20948-Driver/Inc/icm20948.h
/*
 * icm20948.h
 *
 *  Created on: Mar 3, 2024
 *      Author: Lain (trevynexley@gmail.com)
 */

#pragma once

#include "stm32l4xx_hal.h"

#define BITS_PER_BYTE 8

/* ICM20948 CONSTANTS START */

/* ICM20948 SLAVE ADDRESSES START */
static const uint16_t ICM20948_ADDR_L = 0xD0; // SDO(AD0) pin is low
static const uint16_t ICM20948_ADDR_H = 0xD2; // SDO(AD0) pin is high
/* ICM20948 SLAVE ADDRESSES END */

/* ICM20948 REGISTER DEFINITION START */
typedef struct reg
{
	const char* name;
	const uint16_t address;
} reg;
/* ICM20948 REGISTER DEFINITION END */

/* ICM20948 USER UBANK SELECT REGISTER START */
/* BIT 	| NAME 		| DESC
 * 7:6 	| -			| reserved
 * 5:4	| USER_BANK	| value of user bank
 * 3:0	| -			| reserved
 * Reset Value: 0b01000000
 */
static const reg REG_UBANK_SEL = { "UBANK_SEL", 0x7F }; // A RW register but cannot be used in reg_RW or reg_R functions
static const uint8_t REG_UBANK_SEL_RESERVED_MASK = 0b11001111;
typedef enum user_bank
{
	UBANK_0 = 0x0,
	UBANK_1 = 0x10,
	UBANK_2 = 0x20,
	UBANK_3 = 0x30
} user_bank;
/* ICM20948 USER UBANK SELECT REGISTER END */

/* ICM20948 REGISTER DEFINITION CONTINUED START */
typedef struct reg_R
{
	const char* name;
	const uint16_t address;
	const user_bank bank;
} reg_R;

typedef struct reg_RW
{
	const char* name;
	const uint16_t address;
	const user_bank bank;
	const uint8_t reserved_mask;
} reg_RW;
/* ICM20948 REGISTER DEFINITION CONTINUED END */

/* ICM20948 USER UBANK 0 REGISTERS START */
static const reg_R REG_WHO_AM_I = { "WHO_AM_I", 0x00, UBANK_0 };
static const uint8_t REG_WHO_AM_I_VALUE = 0xEA; // Read Only Value

/* BIT 	| NAME 			| DESC
 * 7 	| DMP_EN		| 1 enables DMP features
 * 6	| FIFO_EN		| 1 enables FIFO operation mode
 * 5	| I2C_MST_EN	| 1 enables I2C master I/F module. isolates ES_DA/ES_SCL from SDA/SCL
 * 4	| I2C_IF_DIS	| 1 reset I2C and enter SPI mode only
 * 3	| DMP_RST		| 1 asynchronous reset of DMP module, bit clears after one clock cycle
 * 2	| SRAM_RST		| 1 asynchronous reset of SRAM module, bit clears after one clock cycle
 * 1	| I2C_MST_RST	| 1 asynchronous reset of I2C module, bit clears after one clock cycle
 * 0	| -				| reserved
 * Reset Value: 0
 */
static const reg_RW REG_USER_CTRL = { "USER_CTRL", 0x03, UBANK_0, 0 };
typedef enum user_ctrl_opts
{
	I2C_MST_RST = 0b00000010,
	SRAM_RST = 0b00000100,
	DMP_RST = 0b00001000,
	I2C_IF_DIS = 0b00010000,
	I2C_MST_EN = 0b00100000,
	FIFO_EN = 0b01000000,
	DMP_EN = 0b10000000
} user_ctrl_opts;

/* BIT 	| NAME 			| DESC
 * 7 	| -				| reserved
 * 6	| I2C_MST_CYCLE	| (See p68 for I2C_MST_ODR_CONFIG)
 * 5	| ACCEL_CYCLE	| 1 sets duty cycled mode
 * 4	| GYRO_CYCLE	| 1 sets duty cycled mode
 * 3:0	| -				| reserved
 * Reset Value: 0b01000000
 */
static const reg_RW REG_LP_CONFIG = { "LP_CONFIG", 0x05, UBANK_0, 0b10001111 };
typedef enum lp_config_opts
{
	GYRO_CYCLE = 0b00010000,
	ACCEL_CYCLE = 0b00100000,
	I2C_MST_CYCLE = 0b01000000
} lp_config_opts;

/* BIT 	| NAME 			| DESC
 * 7 	| DEVICE_RESET	| 1 resets all registers
 * 6	| Sleep			| 1 sets sleep mode
 * 5	| LP_EN			| 1 sets low power mode
 * 4	| -				| reserved
 * 3	| TEMP_DIS		| 1 disables temp sensor
 * 2:0	| CLKSEL		| 1-5 auto clock (DS p37)
 * Reset Value: 0b01000001
 */
static const reg_RW REG_PWR_MGMT_1 = { "PWR_MGMT_1", 0x06, UBANK_0, 0b00010000 };
typedef enum pwr_mgmt_1_opts
{
	CLKSEL_AUTO = 0b00000001,
	CLKSEL_INTERNAL = 0b00000110,
	CLKSEL_STOP = 0b00000111,
	TEMP_DIS = 0b00001000,
	LP_EN = 0b00100000,
	SLEEP = 0b01000000,
	DEVICE_RESET = 0b10000000
} pwr_mgmt_1_opts;

/* BIT 	| NAME 				| DESC
 * 7 	| INT1_ACTL			| the logic level for INT1 pin active is low (1) or high (0)
 * 6 	| INT1_OPEN			| INT1 pin is configured as open drain (1) or push-pull (0)
 * 5 	| INT1_LATCH__EN	| INT1 pin level held until interrupt status is cleared (1) or 50us have passed (0)
 * 4 	| INT_ANYRD_2CLEAR	| INT_STATUS is cleared if any read is performed (1) or only when INT_STATUS is read (0)
 * 3 	| ACTL_FSYNC		| logic level for FSYNC pin is active is low (1) or high (0)
 * 2	| FSYNC_INT_MODE_EN	| 1 enables the FSYNC pin to be used as an interrupt (DS p38)
 * 1	| BYPASS_EN			| 1 sets ES_CL and ES_DA pins to bypass mode when I2C master interface is disabled
 * 0	| -					| reserved
 * Reset Value: 0
 */
static const reg_RW REG_INT_PIN_CFG = { "INT_PIN_CFG", 0x0F, UBANK_0, 0b00000001 };
typedef enum int_pin_cfg_opts
{
	BYPASS_EN = 0b00000010,
	FSYNC_INT_MODE_EN = 0b00000100,
	ACTL_FSYNC = 0b00001000,
	INT_ANYRD_2CLEAR = 0b00010000,
	INT1_LATCH__EN = 0b00100000,
	INT1_OPEN = 0b01000000,
	INT1_ACTL = 0b10000000
} int_pin_cfg_opts;

/* BIT 	| NAME 				| DESC
 * 7 	| REG_WOF_EN		| 1 enables wake on FSYNC interrupt
 * 6:4 	| -					| reserved
 * 3 	| WOM_INT_EN		| 1 enables interrupt for wake on motion to propagate to interrupt pin 1
 * 2	| PLL_RDY_EN		| 1 enables PLL RDY interrupt to propagate to interrupt pin 1 (DS p39)
 * 1	| DMP_INT1_EN		| 1 enables DMP interrupt to propagate to interrupt pin 1
 * 0	| I2C_MST_INT_EN	| 1 enables I2C master interrupt to propagate to interrupt pin
 * Reset Value: 0
 */
static const reg_RW REG_INT_ENABLE = { "INT_ENABLE", 0x10, UBANK_0, 0b01110000 };
typedef enum int_enable_opts
{
	I2C_MST_INT_EN = 0b00000001,
	DMP_INT1_EN = 0b00000010,
	PLL_RDY_EN = 0b00000100,
	WOM_INT_EN = 0b00001000,
	REG_WOF_EN = 0b10000000
} int_enable_opts;

static const reg_R REG_DELAY_TIMEH = { "DELAY_TIMEH", 0x28, UBANK_0 };
static const reg_R REG_DELAY_TIMEL = { "DELAY_TIMEL", 0x29, UBANK_0 };

static const reg_R REG_ACCEL_XOUT_H = { "ACCEL_XOUT_H", 0x2D, UBANK_0 };
static const reg_R REG_ACCEL_XOUT_L = { "ACCEL_XOUT_L", 0x2E, UBANK_0 };
static const reg_R REG_ACCEL_YOUT_H = { "ACCEL_YOUT_H", 0x2F, UBANK_0 };
static const reg_R REG_ACCEL_YOUT_L = { "ACCEL_YOUT_L", 0x30, UBANK_0 };
static const reg_R REG_ACCEL_ZOUT_H = { "ACCEL_ZOUT_H", 0x31, UBANK_0 };
static const reg_R REG_ACCEL_ZOUT_L = { "ACCEL_ZOUT_L", 0x32, UBANK_0 };

static const reg_R REG_GYRO_XOUT_H = { "GYRO_XOUT_H", 0x33, UBANK_0 };
static const reg_R REG_GYRO_XOUT_L = { "GYRO_XOUT_L", 0x34, UBANK_0 };
static const reg_R REG_GYRO_YOUT_H = { "GYRO_YOUT_H", 0x35, UBANK_0 };
static const reg_R REG_GYRO_YOUT_L = { "GYRO_YOUT_L", 0x36, UBANK_0 };
static const reg_R REG_GYRO_ZOUT_H = { "GYRO_ZOUT_H", 0x37, UBANK_0 };
static const reg_R REG_GYRO_ZOUT_L = { "GYRO_ZOUT_L", 0x38, UBANK_0 };

static const reg_R REG_TEMP_OUT_H = { "TEMP_OUT_H", 0x33, UBANK_0 };
static const reg_R REG_TEMP_OUT_L = { "TEMP_OUT_L", 0x34, UBANK_0 };

