TExley/STM32-ICM20948-Driver/Inc/icm20948.h
static const reg_R REG_EXT_SLV_SENS_DATA_00 = { "EXT_SLV_SENS_DATA_00", 0x3B, UBANK_0 };

/* BIT 	| NAME 			| DESC
 * 7:4 	| -				| reserved
 * 3 	| SLV_3_FIFO_EN	| write associated EXT_SENS_DATA registers to FIFO at sample rate
 * 2	| SLV_2_FIFO_EN	| write associated EXT_SENS_DATA registers to FIFO at sample rate
 * 1 	| SLV_1_FIFO_EN	| write associated EXT_SENS_DATA registers to FIFO at sample rate
 * 0 	| SLV_0_FIFO_EN	| write associated EXT_SENS_DATA registers to FIFO at sample rate
 */
static const reg_RW REG_FIFO_EN_1 = { "FIFO_EN_1", 0x66, UBANK_0, 0b11110000 };
typedef enum fifo_en_1_opts
{
	SLV_0_FIFO_EN = 0b00000001,
	SLV_1_FIFO_EN = 0b00000010,
	SLV_2_FIFO_EN = 0b00000100,
	SLV_3_FIFO_EN = 0b00001000
} fifo_en_1_opts;

/* ICM20948 USER UBANK 0 REGISTERS END */


/* ICM20948 USER UBANK 1 REGISTERS START */
/* BIT 	| NAME 			| DESC
 * 7:0 	| XA_OFFS[14:7]	| Upper bits of X accel offset cancellation
 * Reset Value: Trimmed on a per-part basis for optimal performance
 */
static const reg_RW REG_XA_OFFS_H = { "XA_OFFS_H", 0x14, UBANK_1, 0 };

/* BIT 	| NAME 			| DESC
 * 7:1 	| XA_OFFS[6:0]	| Lower bits of X accel offset cancellation
 * 0 	| -				| reserved
 * Reset Value: Trimmed on a per-part basis for optimal performance
 */
static const reg_RW REG_XA_OFFS_L = { "XA_OFFS_L", 0x15, UBANK_1, 0b00000001 };

/* BIT 	| NAME 			| DESC
 * 7:0 	| YA_OFFS[14:7]	| Upper bits of Y accel offset cancellation
 * Reset Value: Trimmed on a per-part basis for optimal performance
 */
static const reg_RW REG_YA_OFFS_H = { "YA_OFFS_H", 0x17, UBANK_1, 0 };

/* BIT 	| NAME 			| DESC
 * 7:1 	| YA_OFFS[6:0]	| Lower bits of Y accel offset cancellation
 * 0 	| -				| reserved
 * Reset Value: Trimmed on a per-part basis for optimal performance
 */
static const reg_RW REG_YA_OFFS_L = { "YA_OFFS_L", 0x18, UBANK_1, 0b00000001 };

/* BIT 	| NAME 			| DESC
 * 7:0 	| ZA_OFFS[14:7]	| Upper bits of Z accel offset cancellation
 * Reset Value: Trimmed on a per-part basis for optimal performance
 */
static const reg_RW REG_ZA_OFFS_H = { "ZA_OFFS_H", 0x1A, UBANK_1, 0 };

/* BIT 	| NAME 			| DESC
 * 7:1 	| ZA_OFFS[6:0]	| Lower bits of Z accel offset cancellation
 * 0 	| -				| reserved
 * Reset Value: Trimmed on a per-part basis for optimal performance
 */
static const reg_RW REG_ZA_OFFS_L = { "ZA_OFFS_L", 0x1B, UBANK_1, 0b00000001 };
/* ICM20948 USER UBANK 1 REGISTERS END */


/* ICM20948 USER UBANK 2 REGISTERS START */
/* BIT 	| NAME 				| DESC
 * 7:0 	| GYRO_SMPLRT_DIV	| sample rate dividor 1.1kHz/(1 + GYRO_SMPLRT_DIV)
 * Reset Value: 0
 */
static const reg_RW REG_GYRO_SMPLRT_DIV = { "GYRO_SMPLRT_DIV", 0x00, UBANK_2, 0 };

/* BIT 	| NAME 			| DESC
 * 7:6 	| -				| reserved
 * 5:3	| GYRO_DLPFCFG	| low pass filter config (DS p60)
 * 2:1	| GYRO_FS_SEL	| full scale select (DS p59)
 * 0	| GYRO_FCHOICE	| 1 enable DLPF
 * Reset Value: 0
 */
static const reg_RW REG_GYRO_CONFIG_1 = { "GYRO_CONFIG_1", 0x01, UBANK_2, 0b11000000 };
typedef enum gyro_config_1_opts
{
	GYRO_FCHOICE = 0b00000001,
	// GYRO_FS_SEL_250 by default
	GYRO_FS_SEL_500 = 0b00000010,
	GYRO_FS_SEL_1000 = 0b00000100,
	GYRO_FS_SEL_2000 = 0b00000110,
	// GYRO_DLPFCFG_0 by default
	GYRO_DLPFCFG_1 = 0b00001000,
	GYRO_DLPFCFG_2 = 0b00010000,
	GYRO_DLPFCFG_3 = 0b00011000,
	GYRO_DLPFCFG_4 = 0b00100000,
	GYRO_DLPFCFG_5 = 0b00101000,
	GYRO_DLPFCFG_6 = 0b00110000,
	GYRO_DLPFCFG_7 = 0b00111000
} gyro_config_1_opts;

/* BIT 	| NAME 			| DESC
 * 7:6 	| -				| reserved
 * 5	| XGYRO_CTEN	| 1 enable x self test
 * 4	| YGYRO_CTEN	| 1 enable y self test
 * 3	| ZGYRO_CTEN	| 1 enable z self test
 * 2:0	| GYRO_AVGCFG	| average lp-mode filter config (DS p60)
 * Reset Value: 0
 */
static const reg_RW REG_GYRO_CONFIG_2 = { "GYRO_CONFIG_2", 0x02, UBANK_2, 0b11000000 };
typedef enum gyro_config_2_opts
{
	// GYRO_AVGCFG_1x by default
	GYRO_AVGCFG_2x = 0b00000001,
	GYRO_AVGCFG_4x = 0b00000010,
	GYRO_AVGCFG_8x = 0b00000011,
	GYRO_AVGCFG_16x = 0b00000100,
	GYRO_AVGCFG_32x = 0b00000101,
	GYRO_AVGCFG_64x = 0b00000110,
	GYRO_AVGCFG_128x = 0b00000111,
	ZGYRO_CTEN = 0b00001000,
	YGYRO_CTEN = 0b00010000,
	XGYRO_CTEN = 0b00100000
} gyro_config_2_opts;

/* BIT 	| NAME 					| DESC
 * 7:0 	| XG_OFFS_USER[15:8]	| Upper bits of X gyro offset cancellation
 * Reset Value: 0
 */
static const reg_RW REG_XG_OFFS_USRH = { "XG_OFFS_USRH", 0x03, UBANK_2, 0 };

/* BIT 	| NAME 				| DESC
 * 7:0 	| XG_OFFS_USER[7:0]	| Lower bits of X gyro offset cancellation
 * Reset Value: 0
 */
static const reg_RW REG_XG_OFFS_USRL = { "XG_OFFS_USRL", 0x04, UBANK_2, 0 };

/* BIT 	| NAME 					| DESC
 * 7:0 	| YG_OFFS_USER[15:8]	| Upper bits of Y gyro offset cancellation
 * Reset Value: 0
 */
static const reg_RW REG_YG_OFFS_USRH = { "YG_OFFS_USRH", 0x05, UBANK_2, 0 };

/* BIT 	| NAME 				| DESC
 * 7:0 	| YG_OFFS_USER[7:0]	| Lower bits of Y gyro offset cancellation
 * Reset Value: 0
 */
static const reg_RW REG_YG_OFFS_USRL = { "YG_OFFS_USRL", 0x06, UBANK_2, 0 };

/* BIT 	| NAME 					| DESC
 * 7:0 	| ZG_OFFS_USER[15:8]	| Upper bits of Z gyro offset cancellation
 * Reset Value: 0
 */
static const reg_RW REG_ZG_OFFS_USRH = { "ZG_OFFS_USRH", 0x07, UBANK_2, 0 };

/* BIT 	| NAME 				| DESC
 * 7:0 	| ZG_OFFS_USER[7:0]	| Lower bits of Z gyro offset cancellation
 * Reset Value: 0
 */
static const reg_RW REG_ZG_OFFS_USRL = { "ZG_OFFS_USRL", 0x08, UBANK_2, 0 };

/* BIT 	| NAME 			| DESC
 * 7:1 	| -				| reserved
 * 0	| ODR_ALIGN_EN	| sensor start time alignment if and smprt set
 * Reset Value: 0
 */
static const reg_RW REG_ODR_ALIGN_EN = { "ODR_ALIGN_EN", 0x09, UBANK_2, 0b11111110 };
typedef enum odr_align_opts
{
	ODR_ALIGN_EN = 0b00000001
} odr_align_opts;

/* BIT 	| NAME 				| DESC
 * 7:4 	| -					| reserved
 * 3:0	| ACCEL_SMPLRT_DIV	| MSB for ACCEL_SMPLRT_DIV
 * Reset Value: 0
 */
static const reg_RW REG_ACCEL_SMPLRT_DIV_1 = { "ACCEL_SMPLRT_DIV_1", 0x10, UBANK_2, 0b11110000 };

/* BIT 	| NAME 				| DESC
 * 7:0 	| ACCEL_SMPLRT_DIV	| LSB for sample rate dividor 1.125kHz/(1 + ACCEL_SMPLRT_DIV[11:0])
 * Reset Value: 0
 */
static const reg_RW REG_ACCEL_SMPLRT_DIV_2 = { "ACCEL_SMPLRT_DIV_2", 0x11, UBANK_2, 0 };

/* BIT 	| NAME 			| DESC
 * 7:6 	| -				| reserved
 * 5:3	| ACCEL_DLPFCFG	| low pass filter config (DS p64)
 * 2:1	| ACCEL_FS_SEL	| full scale select (DS p64)
 * 0	| ACCEL_FCHOICE	| 1 enable DLPF
 * Reset Value: 0b00000001
 */
static const reg_RW REG_ACCEL_CONFIG_1 = { "ACCEL_CONFIG_1", 0x14, UBANK_2, 0b11000000 };
typedef enum accel_config_1_opts
{
	ACCEL_FCHOICE = 0b00000001,
	// ACCEL_FS_SEL_2g by default
	ACCEL_FS_SEL_4g = 0b00000010,
	ACCEL_FS_SEL_8g = 0b00000100,
	ACCEL_FS_SEL_16g = 0b00000110,
	// ACCEL_DLPFCFG_0 by default
	ACCEL_DLPFCFG_1 = 0b00001000,
	ACCEL_DLPFCFG_2 = 0b00010000,
	ACCEL_DLPFCFG_3 = 0b00011000,
	ACCEL_DLPFCFG_4 = 0b00100000,
	ACCEL_DLPFCFG_5 = 0b00101000,
	ACCEL_DLPFCFG_6 = 0b00110000,
	ACCEL_DLPFCFG_7 = 0b00111000
} accel_config_1_opts;

/* BIT 	| NAME 			| DESC
 * 7:5 	| -				| reserved
 * 4	| AX_ST_EN_REG	| 1 enable x self test
 * 3	| AY_ST_EN_REG	| 1 enable y self test
 * 2	| AZ_ST_EN_REG	| 1 enable z self test
 * 1:0	| DEC3_CFG		| controls samples averaged in devimator (DS p65)
 * Reset Value: 0
 */
static const reg_RW REG_ACCEL_CONFIG_2 = { "ACCEL_CONFIG_2", 0x15, UBANK_2, 0b11100000 };
typedef enum accel_config_2_opts
{
	// DEC3_CFG_1 or DEC3_CFG_4 by default (DS p65)
	DEC3_CFG_8 = 0b00000001,
	DEC3_CFG_16 = 0b00000010,
	DEC3_CFG_32 = 0b00000011,
	AZ_ST_EN_REG = 0b00000100,
	AY_ST_EN_REG = 0b00001000,
	AX_ST_EN_REG = 0b00010000
} accel_config_2_opts;

/* BIT 	| NAME 				| DESC
 * 7 	| DELAY_TIME_EN		| 1 enables delay time measurement between FSYNC event and the first ODR event after FSYNC event
 * 6	| -					| reserved
 * 5	| WOF_DEGLITCH_EN	| 1 enables digital deglitching of FSYNC input for wake on FSYNC
 * 4	| WOF_EDGE_INT		| wake on FSYNC is an edge (1) or level (0) interrupt
 * 3:0	| EXT_SYNC_SET		| enables the FSYNC pin data to be sampled for the chosen bit sync location (DS p66)
 * Reset Value: 0
 */
static const reg_RW REG_FSYNC_CONFIG = { "FSYNC_CONFIG", 0x52, UBANK_2, 0b01000000 };
typedef enum fsync_config_opts
{
	// EXT_SYNC_DISABLED by default
	EXT_SYNC_TEMP_OUT_L = 0b00000001,
	EXT_SYNC_GYRO_XOUT_L = 0b00000010,
	EXT_SYNC_GYRO_YOUT_L = 0b00000011,
	EXT_SYNC_GYRO_ZOUT_L = 0b00000100,
	EXT_SYNC_ACCEL_XOUT_L = 0b00000101,
	EXT_SYNC_ACCEL_YOUT_L = 0b00000110,
	EXT_SYNC_ACCEL_ZOUT_L = 0b00000111,
	WOF_EDGE_INT = 0b00010000,
	WOF_DEGLITCH_EN = 0b00100000,
	DELAY_TIME_EN = 0b10000000
} fsync_config_opts;

/* BIT 	| NAME 			| DESC
 * 7:3 	| -				| unused (not labeled reserved)
 * 2:0	| TEMP_DLPFCFG	| low pass filter config (DS p67)
 * Reset Value: 0
 */
static const reg_RW REG_TEMP_CONFIG = { "TEMP_CONFIG", 0x53, UBANK_2, 0 };
typedef enum temp_config_opts
{
	// TEMP_DLPFCFG_0 by default
	TEMP_DLPFCFG_1 = 0b00000001,
	TEMP_DLPFCFG_2 = 0b00000010,
	TEMP_DLPFCFG_3 = 0b00000011,
	TEMP_DLPFCFG_4 = 0b00000100,
	TEMP_DLPFCFG_5 = 0b00000101,
	TEMP_DLPFCFG_6 = 0b00000110,
	TEMP_DLPFCFG_7 = 0b00000111
} temp_config_opts;
/* ICM20948 USER UBANK 2 REGISTERS END */


