TExley/STM32-ICM20948-Driver/Inc/icm20948.h
/* ICM20948 USER UBANK 3 REGISTERS START */
/* BIT 	| NAME 					| DESC
 * 7:4 	| -						| reserved
 * 3:0	| I2C_MST_ODR_CONFIG	| sample rate dividor 1.1kHz/(2^I2C_MST_ODR_CONFIG)
 * Reset Value: 0
 */
static const reg_RW REG_I2C_MST_ODR_CONFIG = { "I2C_MST_ODR_CONFIG", 0x00, UBANK_3, 0b11110000 };

/* BIT 	| NAME 			| DESC
 * 7 	| MULT_MST_EN	| enables multi-master capability
 * 6:5	| -				| reserved
 * 4	| I2C_MST_P_NSR	| 1/0 sets transition btwn reads to stop/restart
 * 3:0	| I2C_MST_CLK	| sets I2C master clock frequency (DS p68)
 * Reset Value: 0
 */
static const reg_RW REG_I2C_MST_CTRL = { "I2C_MST_CTRL", 0x01, UBANK_3, 0b01100000 };
typedef enum i2c_mst_ctrl_opts
{
	// I2C_MST_CLK_0 by default (DS p81)
	// I2C_MST_CLK_1 is undefined
	// I2C_MST_CLK_2 == I2C_MST_CLK_0
	I2C_MST_CLK_3 = 0b00000011,
	I2C_MST_CLK_4 = 0b00000100,
	// I2C_MST_CLK_5 == I2C_MST_CLK_3
	I2C_MST_CLK_6 = 0b00000110,
	I2C_MST_CLK_7 = 0b00000111,
	I2C_MST_CLK_8 = 0b00001000,
	// I2C_MST_CLK_9 == I2C_MST_CLK_3
	I2C_MST_CLK_10 = 0b00001010,
	// I2C_MST_CLK_11 == I2C_MST_CLK_10
	I2C_MST_CLK_12 = 0b00001100,
	// I2C_MST_CLK_13 == I2C_MST_CLK_3
	// I2C_MST_CLK_14 == I2C_MST_CLK_7
	// I2C_MST_CLK_15 == I2C_MST_CLK_7
	I2C_MST_P_NSR = 0b00010000,
	MULT_MST_EN = 0b10000000
} i2c_mst_ctrl_opts;

/* BIT 	| NAME 				| DESC
 * 7 	| DELAY_ES_SHADOW	| Delays shadowing of external sensor data until all data is received
 * 6:5	| -					| reserved
 * 4	| I2C_SLV4_DELAY_EN	| 1 sets slave 4 to only be accessed 1/(1+I2C_SLC4_DLY) samples
 * 3	| I2C_SLV3_DELAY_EN	| 1 sets slave 3 to only be accessed 1/(1+I2C_SLC4_DLY) samples
 * 2	| I2C_SLV2_DELAY_EN	| 1 sets slave 2 to only be accessed 1/(1+I2C_SLC4_DLY) samples
 * 1	| I2C_SLV1_DELAY_EN	| 1 sets slave 1 to only be accessed 1/(1+I2C_SLC4_DLY) samples
 * 0	| I2C_SLV0_DELAY_EN	| 1 sets slave 0 to only be accessed 1/(1+I2C_SLC4_DLY) samples
 * Reset Value: 0
 */
static const reg_RW REG_I2C_MST_DELAY_CTRL = { "I2C_MST_DELAY_CTRL", 0x02, UBANK_3, 0b01100000 };
typedef enum i2c_mst_delay_ctrl_opts
{
	I2C_SLV0_DELAY_EN = 0b00000001,
	I2C_SLV1_DELAY_EN = 0b00000010,
	I2C_SLV2_DELAY_EN = 0b00000100,
	I2C_SLV3_DELAY_EN = 0b00001000,
	I2C_SLV4_DELAY_EN = 0b00010000,
	DELAY_ES_SHADOW = 0b10000000
} i2c_mst_delay_ctrl_opts;

/* BIT 	| NAME 			| DESC
 * 7 	| I2C_SLV0_RNW	| 1/0 – Transfer is a read/write
 * 6:0	| I2C_ID_0		| physical address of I2C slave 0
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV0_ADDR = { "I2C_SLV0_ADDR", 0x03, UBANK_3, 0 };
typedef enum i2c_slv_addr_opts
{ // same value for all I2C_SLVX_ADDR
	I2C_SLV_RNW = 0b10000000
} i2c_slv_addr_opts;

/* BIT 	| NAME 			| DESC
 * 7:0 	| I2C_SLV0_REG	| register address from where to begin data transfer
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV0_REG = { "I2C_SLV0_REG", 0x04, UBANK_3, 0 };

/* BIT 	| NAME 				| DESC
 * 7 	| I2C_SLV0_EN		| 1 reads data at the sample rate and stores it at the first available EXT_SENS_DATA register
 * 6 	| I2C_SLV0_BYTE_SW	| 1 enables swapping bytes when reading both the low and high byte of a word (DS p70)
 * 5 	| I2C_SLV0_REG_DIS	| 1 the transaction does not write a register value, it will only read data, or write data
 * 4 	| I2C_SLV0_GRP		| sets wether groups of bytes swapped end in odd (0) or even (1) registers
 * 3:0 	| I2C_SLV0_LENG		| number of bytes to be read from I2C slave 0
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV0_CTRL = { "I2C_SLV0_CTRL", 0x05, UBANK_3, 0 };
typedef enum i2c_slv_ctrl_opts
{ // same value for all I2C_SLVX_ADDR
// I2C_SLV_LENG_0 by default
	I2C_SLV_LENG_1 = 0b00000001,
	I2C_SLV_LENG_2 = 0b00000010,
	I2C_SLV_LENG_3 = 0b00000011,
	I2C_SLV_LENG_4 = 0b00000100,
	I2C_SLV_LENG_5 = 0b00000101,
	I2C_SLV_LENG_6 = 0b00000110,
	I2C_SLV_LENG_7 = 0b00000111,
	I2C_SLV_LENG_8 = 0b00001000,
	I2C_SLV_LENG_9 = 0b00001001,
	I2C_SLV_LENG_10 = 0b00001010,
	I2C_SLV_LENG_11 = 0b00001011,
	I2C_SLV_LENG_12 = 0b00001100,
	I2C_SLV_LENG_13 = 0b00001101,
	I2C_SLV_LENG_14 = 0b00001110,
	I2C_SLV_LENG_15 = 0b00001111,
	I2C_SLV_GRP = 0b00010000,
	I2C_SLV_REG_DIS = 0b00100000,
	I2C_SLV_BYTE_SW = 0b01000000,
	I2C_SLV_EN = 0b10000000
} i2c_slv_ctrl_opts;

/* BIT 	| NAME 			| DESC
 * 7:0 	| I2C_SLV0_DO	| data out when slave 0 is set to write
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV0_DO = { "I2C_SLV0_DO", 0x06, UBANK_3, 0 };

/* BIT 	| NAME 			| DESC
 * 7 	| I2C_SLV1_RNW	| 1/0 – Transfer is a read/write
 * 6:0	| I2C_ID_1		| physical address of I2C slave 1
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV1_ADDR = { "I2C_SLV1_ADDR", 0x07, UBANK_3, 0 };

/* BIT 	| NAME 			| DESC
 * 7:0 	| I2C_SLV1_REG	| register address from where to begin data transfer
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV1_REG = { "I2C_SLV1_REG", 0x08, UBANK_3, 0 };

/* BIT 	| NAME 				| DESC
 * 7 	| I2C_SLV1_EN		| 1 reads data at the sample rate and stores it at the first available EXT_SENS_DATA register
 * 6 	| I2C_SLV1_BYTE_SW	| 1 enables swapping bytes when reading both the low and high byte of a word (DS p70)
 * 5 	| I2C_SLV1_REG_DIS	| 1 the transaction does not write a register value, it will only read data, or write data
 * 4 	| I2C_SLV1_GRP		| sets wether groups of bytes swapped end in odd (0) or even (1) registers
 * 3:0 	| I2C_SLV1_LENG		| number of bytes to be read from I2C slave 1
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV1_CTRL = { "I2C_SLV1_CTRL", 0x09, UBANK_3, 0 };

/* BIT 	| NAME 			| DESC
 * 7:0 	| I2C_SLV1_DO	| data out when slave 1 is set to write
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV1_DO = { "I2C_SLV1_DO", 0x0A, UBANK_3, 0 };

/* BIT 	| NAME 			| DESC
 * 7 	| I2C_SLV4_RNW	| 1/0 – Transfer is a read/write
 * 6:0	| I2C_ID_4		| physical address of I2C slave 4
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV4_ADDR = { "I2C_SLV4_ADDR", 0x13, UBANK_3, 0 };

/* BIT 	| NAME 			| DESC
 * 7:0 	| I2C_SLV4_REG	| register address from where to begin data transfer
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV4_REG = { "I2C_SLV4_REG", 0x14, UBANK_3, 0 };

/* BIT 	| NAME 				| DESC
 * 7 	| I2C_SLV4_EN		| 1 data transfer at the sample rate and stores read data in I2C_SLV4_DI, bit clears afterwards
 * 6 	| I2C_SLV4_INT_EN	| 1 enables the completion of the I2C slave 4 data transfer to cause an interrupt
 * 5 	| I2C_SLV4_REG_DIS	| 1 the transaction does not write a register value, it will only read data, or write data
 * 4:0 	| I2C_SLV4_DLY		| when enabled via the I2C_MST_DELAY_CTRL, those slaves will only be enabled every 1/(1+I2C_SLV4_DLY)
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV4_CTRL = { "I2C_SLV4_CTRL", 0x15, UBANK_3, 0 };
typedef enum i2c_slv4_ctrl_opts
{
	I2C_SLV4_DLY_1 = 0b00000001,
	I2C_SLV4_DLY_2 = 0b00000010,
	I2C_SLV4_DLY_3 = 0b00000011,
	I2C_SLV4_DLY_4 = 0b00000100,
	I2C_SLV4_DLY_5 = 0b00000101,
	I2C_SLV4_DLY_6 = 0b00000110,
	I2C_SLV4_DLY_7 = 0b00000111,
	I2C_SLV4_DLY_8 = 0b00001000,
	I2C_SLV4_DLY_9 = 0b00001001,
	I2C_SLV4_DLY_10 = 0b00001010,
	I2C_SLV4_DLY_11 = 0b00001011,
	I2C_SLV4_DLY_12 = 0b00001100,
	I2C_SLV4_DLY_13 = 0b00001101,
	I2C_SLV4_DLY_14 = 0b00001110,
	I2C_SLV4_DLY_15 = 0b00001111,
	I2C_SLV4_DLY_16 = 0b00010000,
	I2C_SLV4_DLY_17 = 0b00010001,
	I2C_SLV4_DLY_18 = 0b00010010,
	I2C_SLV4_DLY_19 = 0b00010011,
	I2C_SLV4_DLY_20 = 0b00010100,
	I2C_SLV4_DLY_21 = 0b00010101,
	I2C_SLV4_DLY_22 = 0b00010110,
	I2C_SLV4_DLY_23 = 0b00010111,
	I2C_SLV4_DLY_24 = 0b00011000,
	I2C_SLV4_DLY_25 = 0b00011001,
	I2C_SLV4_DLY_26 = 0b00011010,
	I2C_SLV4_DLY_27 = 0b00011011,
	I2C_SLV4_DLY_28 = 0b00011100,
	I2C_SLV4_DLY_29 = 0b00011101,
	I2C_SLV4_DLY_30 = 0b00011110,
	I2C_SLV4_DLY_31 = 0b00011111,
	I2C_SLV4_INT_EN = 0b01000000,
} i2c_slv4_ctrl_opts;

/* BIT 	| NAME 			| DESC
 * 7:0 	| I2C_SLV4_DO	| data out when slave 4 is set to write
 * Reset Value: 0
 */
static const reg_RW REG_I2C_SLV4_DO = { "I2C_SLV4_DO", 0x16, UBANK_3, 0 };

static const reg_R REG_I2C_SLV4_DI = { "I2C_SLV4_DI", 0x17, UBANK_3 };
/* ICM20948 USER UBANK 3 REGISTERS END */

/* SENSOR SUPPORT STRUCTS START */
typedef struct int16_vector3
{
	int16_t x;
	int16_t y;
	int16_t z;
} int16_vector3;

typedef struct float_vector3
{
	float x;
	float y;
	float z;
} float_vector3;
