TExley/STM32-ICM20948-Driver/Inc/icm20948.h
/* SENSOR SUPPORT STRUCTS END */

/* DELAYS AND TIMEOUTS START */
// Start-up time for register read/write from power-up or reset
static const uint32_t STARTUP_DELAY = 100;

/* Start-up time for sensor output from sleep
 * ACC ~ 30ms
 * GYR ~ 35ms
 * MAG ~ 8ms
 */
static const uint32_t WAKE_DELAY = 45;

// Maximum time-out to wait for any sensor ACK
static const uint32_t MAXIMUM_ICM_TIMEOUT = 20;
/* DELAYS AND TIMEOUTS END */

/* ICM20948 ENUMS START */
typedef enum SDO_Pinouts
{
	SDO_LOW,
	SDO_HIGH
} SDO_Pinouts;
/* ICM20948 ENUMS END */
/* ICM20948 CONSTANTS END */

/* AK09916 CONSTANTS START */
static const uint8_t AK09916_ADDR_READ = 0x8C;
static const uint8_t AK09916_ADDR_WRITE = 0x0C;
static const uint8_t AK09916_WIA_VALUE = 0x09;

typedef enum cntl2_modes
{
	POWER_DOWN = 0,
	SINGLE_MEASURE = 0b00000001,
	CONT_MEASURE_1 = 0b00000010,
	CONT_MEASURE_2 = 0b00000100,
	CONT_MEASURE_3 = 0b00000110,
	CONT_MEASURE_4 = 0b00001000,
	SELF_TEST = 0b00010000
} cntl2_modes;

typedef enum cntl3_modes
{
	SOFT_RESET = 0b000001
} cntl3_modes;

typedef enum AK09916_register
{
	WIA = 0x01,
	ST1 = 0x10,
	HXL = 0x11,
	HXH = 0x12,
	HYL = 0x13,
	HYH = 0x14,
	HZL = 0x15,
	HZH = 0x16,
	ST2 = 0x18,
	CNTL2 = 0x31,
	CNTL3 = 0x32
} AK09916_register;
/* AK09916 CONSTANTS END */

/* ICM20948 FUNCTIONS START */
HAL_StatusTypeDef ICM20948_Init(I2C_HandleTypeDef* hi2c, SDO_Pinouts pinout);

HAL_StatusTypeDef ICM20948_ReadUserBank(uint8_t* data);
HAL_StatusTypeDef ICM20948_ChangeUserBank(user_bank ubank);

HAL_StatusTypeDef ICM20948_ReadRegister(const reg_R* regi, uint8_t* data);
HAL_StatusTypeDef ICM20948_ReadRegisters(const reg_R* regi, uint8_t* data, uint8_t size);
HAL_StatusTypeDef ICM20948_WriteRegister(const reg_RW* regi, uint8_t data);
HAL_StatusTypeDef ICM20948_WriteRegisterEnables(const reg_RW* regi, uint8_t data);
HAL_StatusTypeDef ICM20948_WriteRegisterEnDisables(const reg_RW* regi, uint8_t data_en, uint8_t data_dis);
HAL_StatusTypeDef ICM20948_WriteRegisterDisables(const reg_RW* regi, uint8_t data);

HAL_StatusTypeDef ICM20948_ReadAccelRegisters(int16_vector3* accel);
HAL_StatusTypeDef ICM20948_ReadMagRegisters(int16_vector3* mag);
HAL_StatusTypeDef ICM20948_ReadGyroRegisters(int16_vector3* gyro);
HAL_StatusTypeDef ICM20948_ReadAccelGryoRegisters(int16_vector3* accel, int16_vector3* gyro);
float_vector3 ICM20948_ScaleSensorVectors(int16_vector3* sensor_v, float scale_factor);

HAL_StatusTypeDef ICM20948_MeasureGyroOffset(uint32_t ticks, int16_vector3* gyro, uint32_t gyro_update_period_ms);
HAL_StatusTypeDef ICM20948_WriteGyroOffsetRegisters(int16_vector3* gyro_offset);

HAL_StatusTypeDef ICM20948_Wake();
HAL_StatusTypeDef ICM20948_Sleep();
HAL_StatusTypeDef ICM20948_Reset();

HAL_StatusTypeDef AK09916_Init(cntl2_modes mode);
HAL_StatusTypeDef AK09916_ReadRegisters(AK09916_register regi, uint8_t size);
HAL_StatusTypeDef AK09916_SetCNTL2(cntl2_modes mode);
HAL_StatusTypeDef AK09916_Reset();
/* ICM20948 FUNCTIONS END */
